Revit 2024 API
ExportResolution Enumeration
 An enumerated type listing possible options to control the tessellation quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum ExportResolution
Visual Basic
Public Enumeration ExportResolution
Visual C++
public enum class ExportResolution
Members
Member name | Description
Custom |  Tessellated export with custom resolution (all tessellation parameters have default values).
Fine |  Tessellated export with fine resolution.
Medium |  Tessellated export with medium resolution.
Coarse |  Tessellated export with coarse resolution.
See Also
Autodesk.Revit.DB Namespace